{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences","layers":[{"class_name":"Dense","config":{"units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense120","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.1613410347907437,"noise_shape":null,"seed":null,"name":"dropout_Dropout90","trainable":true}},{"class_name":"Dense","config":{"units":18,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense121","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1613410347907437,"noise_shape":null,"seed":null,"name":"dropout_Dropout91","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense122","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1613410347907437,"noise_shape":null,"seed":null,"name":"dropout_Dropout92","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense123","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences.weights.bin"],"weights":[{"name":"dense_Dense120/kernel","shape":[512,2],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense121/kernel","shape":[2,18],"dtype":"float32"},{"name":"dense_Dense121/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense122/kernel","shape":[18,5],"dtype":"float32"},{"name":"dense_Dense122/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense123/kernel","shape":[5,1],"dtype":"float32"}]}]}