{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences","layers":[{"class_name":"Dense","config":{"units":2,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense191","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.14566115183629058,"noise_shape":null,"seed":null,"name":"dropout_Dropout144","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense192","trainable":true}},{"class_name":"Dropout","config":{"rate":0.14566115183629058,"noise_shape":null,"seed":null,"name":"dropout_Dropout145","trainable":true}},{"class_name":"Dense","config":{"units":18,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense193","trainable":true}},{"class_name":"Dropout","config":{"rate":0.14566115183629058,"noise_shape":null,"seed":null,"name":"dropout_Dropout146","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense194","trainable":true}},{"class_name":"Dropout","config":{"rate":0.14566115183629058,"noise_shape":null,"seed":null,"name":"dropout_Dropout147","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense195","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences.weights.bin"],"weights":[{"name":"dense_Dense191/kernel","shape":[512,2],"dtype":"float32"},{"name":"dense_Dense191/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense192/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense192/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense193/kernel","shape":[2,18],"dtype":"float32"},{"name":"dense_Dense193/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense194/kernel","shape":[18,5],"dtype":"float32"},{"name":"dense_Dense194/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense195/kernel","shape":[5,1],"dtype":"float32"}]}]}